v7/_special/dynamicMesh_AMI/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform 0;
    }
    maxX
    {
        type            fixedValue;
        value           uniform 0;
    }
    minY
    {
        type            fixedValue;
        value           uniform 0;
    }
    maxY
    {
        type            fixedValue;
        value           uniform 0;
    }
    minZ
    {
        type            fixedValue;
        value           uniform 0;
    }
    maxZ
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    AMI
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI_slave
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    ruhr
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
